{
  "education": [
    {
      "awards_achievements": [
        "GPA: 3.61/4.0"
      ],
      "degree": "Post Graduate Certificate in Web Development",
      "department": "Computer Engineering",
      "duration": "2021-2022",
      "school_name": "Conestoga College"
    },
    {
      "awards_achievements": [
        "GPA: 8.72/10.0"
      ],
      "degree": "Bachelors in Computer Engineering",
      "department": "Computer Engineering",
      "duration": "2017-2021",
      "school_name": "LJ Institute of Engineering and Technology"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_MahekPanchal",
  "highlighted_projects": [
    {
      "description": "Created a user-friendly web application that enabled influencers to easily access information from the portal and create compelling content for impactful marketing campaigns endorsed by the registered brands.Deployed an Influencer Management System based on the MERN stack, utilizing AWS EC2, S3, and SNS services Executed thorough threat detection and analysis, detecting and analyzing user behavior patterns among registered influencers to ensure robust system security and integrity.",
      "name": "Influencer Management System"
    },
    {
      "description": "Built a strong Hygiene Surveillance system using Java to check if restaurant staff were wearing gloves and masks during COVID.Used TensorFlow and computer vision to create an accurate hygiene surveillance system and trained AI models using deep learning.",
      "name": "Hygiene Surveillance"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Developed a Cluster Resource Monitoring Application for Linux CentOS. Created bash scripts capable of retrieving hardware specifications and node resource usage. Real-time data was gathered using the crontab feature and stored in a Postgres database managed within a Docker container.",
      "git_url": "/linux_sql",
      "name": "Linux Cluster Resource Monitoring App"
    },
    {
      "description": [
        "Twitter App: Curabitur laoreet tristique leo, eget suscipit nisi. Sed in sodales ex. Maecenas vitae tincidunt dui, et eleifend quam.",
        "JDBC App: Curabitur laoreet tristique leo, eget suscipit nisi. Sed in sodales ex. Maecenas vitae tincidunt dui, et eleifend quam.",
        "Grep App: Curabitur laoreet tristique leo, eget suscipit nisi. Sed in sodales ex. Maecenas vitae tincidunt dui, et eleifend quam."
      ],
      "git_url": "/core_java",
      "name": "Core Java Apps"
    },
    {
      "description": "",
      "git_url": "/springboot",
      "name": "Springboot App"
    },
    {
      "description": "",
      "git_url": "/python_data_anlytics",
      "name": "Python Data Analytics"
    },
    {
      "description": "",
      "git_url": "/hadoop",
      "name": "Hadoop"
    },
    {
      "description": "",
      "git_url": "/spark",
      "name": "Spark"
    },
    {
      "description": "",
      "git_url": "/cloud_devops",
      "name": "Cloud/DevOps"
    }
  ],
  "name": "Mahek Panchal",
  "others": [
    {
      "bullets": [
        "Rotaract Club of Ahmedabad Midtown"
      ],
      "title": "Board Of Directors for Women Empowerment"
    },
    {
      "bullets": [
        "Excellence Award in Computer"
      ],
      "title": "Awards"
    },
    {
      "bullets": [
        "Dancing",
        "Swimming",
        "Badminton"
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "Engaged in several projects, boosting my technical expertise. Adopted an agile approach for project sprints. Expanded my skill set by learning new languages and frameworks such as Bash, Spring Boot, and SQL, and diligently maintained updated source code for each project through GitHub.",
      "duration": "2023-present",
      "title": "Technical Consultant"
    },
    {
      "company": "Softvan",
      "description": "Collaborated with a team of developers to optimize system performance through efficient software development life cycle management. Implemented software engineering patterns to recognize and resolve issues, leading to reduced debugging durations. Conducted daily scrum meetings to ensure transparent communication and on-time task completion.Worked closely with stakeholders to enhance user experience and system performance.",
      "duration": "2020-2021",
      "title": "Software Development Intern"
    }
  ],
  "skills": {
    "competent": [
      "Docker",
      "HTML",
      "Javascript",
      "CSS",
      "Google Cloud Platform(GCP)"
    ],
    "familiar": [
      "Tensorflow",
      "Springboot",
      "AWS Services",
      "MERN stack",
      "C++"
    ],
    "proficient": [
      "Java",
      "Linux/Bash",
      "RDBMS/SQL",
      "Agile/Scrum",
      "Git"
    ]
  },
  "summary": "I'd describe myself as an inquisitive individual always eager to embrace new knowledge. I completed my bachelor's in Computer Engineering at LJIET and pursued a postgraduate certificate in Web Development at Conestoga College. During my two years in Canada, I've welcomed various part-time roles, refining my interpersonal and communication skills. I'm currently seeking development roles because I find the process of creating new applications incredibly intriguing.In my final year of undergrad, I embarked on an internship at Softvan, where I engaged in hands-on projects, collaborated with diverse teams, and delved into new frameworks like Spring Boot. This experience honed my existing skills while introducing me to algorithms and expanding my proficiency in various tools and technologies"
}
